Repository: mozilla-l10n/mt-training-data
Catalog: sat/sat_pontoon.tmx
Source language: en_us
Languages: sat

source: preference
sat: ᱠᱩᱥᱤᱭᱟᱜ

source: release
sat: ᱟᱲᱟᱠ

source: report
sat: ᱠᱷᱚᱵᱚᱨ

source: revert
sat: ᱫᱚᱦᱲᱟ ᱟᱹᱨᱩ

source: search suggestion
sat: ᱥᱚᱞᱟᱦ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: security keys
sat: ᱨᱩᱠᱷᱤᱭᱟᱹ ᱠᱟᱴᱷᱤ

source: sensitive
sat: ᱥᱚᱢᱵᱮᱫᱚᱱ

source: sidebar
sat: ᱫᱷᱟᱨᱮ ᱨᱮᱭᱟᱜ ᱦᱩᱨᱠᱟᱹᱬ

source: sign
sat: ᱥᱩᱦᱤ

source: signer
sat: ᱥᱩᱦᱤ ᱮᱢ ᱤᱡ

source: studies
sat: ᱯᱟᱲᱦᱟᱣ ᱠᱚ

source: track
sat: ᱜᱷᱮᱨ ᱮᱥᱮᱫ

source: trackers
sat: ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ

source: Turbo Mode
sat: ᱴᱟᱹᱨᱵᱚ ᱢᱚᱰ

source: unencrypted
sat: ᱵᱟᱝ ᱫᱟᱱᱟᱝᱟᱜ

source: unresponsive
sat: ᱵᱟᱭ ᱵᱟᱛᱟᱣ

source: unsafe
sat: ᱵᱟᱝᱨᱟᱠᱷᱭᱟ

source: validate
sat: ᱯᱩᱥᱴᱟᱹᱣ ᱪᱷᱚ

source: validity
sat: ᱯᱩᱥᱴᱟᱹᱣ ᱪᱷᱚ

source: version
sat: ᱦᱟᱹᱞᱤᱭᱟᱠ

source: Web Authentication
sat: ᱣᱮᱵ ᱯᱨᱟᱹᱢᱟᱬᱤᱭᱟᱹᱛᱟ
